-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2017 �?12 �?23 �?13:55
-- 服务器版本: 5.5.47
-- PHP 版本: 5.5.30

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `login`
--

-- --------------------------------------------------------

--
-- 表的结构 `bookinfo`
--

CREATE TABLE IF NOT EXISTS `bookinfo` (
  `barcode` varchar(30) CHARACTER SET gb2312 DEFAULT NULL COMMENT '图书条形码',
  `bookname` varchar(70) CHARACTER SET gb2312 DEFAULT NULL COMMENT '图书名称',
  `typeid` varchar(10) DEFAULT NULL COMMENT '图书类型',
  `bookpress` varchar(225) CHARACTER SET gb2312 DEFAULT NULL COMMENT '出版社',
  `bookcase` varchar(10) DEFAULT NULL COMMENT '图书书架',
  `state` varchar(10) DEFAULT ' 0' COMMENT '状态：检查该书是否被借：1为已借，0为未借'
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `bookinfo`
--

INSERT INTO `bookinfo` (`barcode`, `bookname`, `typeid`, `bookpress`, `bookcase`, `state`) VALUES
('98765432144', 'PHP函数参考大全', '计算机程序设计', '人民邮电出版社', 'PHP书架', '1'),
('12434234345', '往生路', '心理', '人民邮电出版社', '文学书架', '1'),
('12345678954', 'PHP数据库系统开发完全手册', '数据库技术', '人民邮电出版社', 'VB书架', '0'),
('3354645724', 'php概论', 'IT', '人民邮电出版社', 'PHP书架', ' 0'),
('12309877433', 'Vue.js实例大全', 'Vue', '人民邮电出版社', 'Vue书架', '0'),
('34664322456', '心理咨询大全', '心理', '人民邮电出版社', '文学书架', '0'),
('65934708023', 'MySql数据库', '数据库', '人民邮电出版社', 'MySql书架', '0'),
('54352907097', '毛概', '政治', '人民邮电出版社', '政治书架', '0'),
('12434235340', '得到的往生', '心理', '人民邮电出版社', '文学书架', '0'),
('432545446', '一只猫的生活意见', '文学', '人民邮电出版社', 'PHP书架', ' 0'),
('876754564', '网站建设', 'IT', '人民邮电出版社', 'PHP书架', ' 0'),
('545657678', 'Web前端设计', 'IT', '人民邮电出版社', 'PHP书架', ' 0'),
('332435467', 'oracle数据库', '数据库', '人民邮电出版社', 'VB书架', ' 0'),
('453253423', 'access程序', '数据库', '人民邮电出版社', 'VB书架', ' 0'),
('435346546', 'VB家庭书架程序', 'IT', '人民邮电出版社', 'VB书架', ' 0'),
('456345324', 'VB程序设计', 'IT', '人民邮电出版社', 'VB书架', ' 0'),
('5436457657', '心理现象包括心理过程', '心理', '人民邮电出版社', 'PHP书架', ' 0'),
('324526456', '心理测试', '心理', '人民邮电出版社', 'VB书架', ' 0'),
('454645743', '职场心理', '心理', '人民邮电出版社', 'VB书架', ' 0'),
('354364565', '性格测试', '心理', '人民邮电出版社', 'PHP书架', ' 0'),
('46547568', '数据库操作技术', '数据库技术', '人民邮电出版社', 'VB书架', ' 0'),
('567523422', '数据库技术大全', '数据库技术', '人民邮电出版社', 'VB书架', ' 0'),
('3435352434', '计算机程序设计', '数据库技术', '人民邮电出版社', 'PHP书架', ' 0'),
('231242354', '计算机硬件说明', '数据库技术', '人民邮电出版社', 'PHP书架', ' 0'),
('3253464565', '狭义与广义相对论浅说 ', '信息科学技术 ', '人民邮电出版社', 'PHP书架', ' 0'),
('2423453456', '信息科技的重要分枝', '信息科学技术 ', '人民邮电出版社', 'PHP书架', ' 0'),
('5436456455', '信息科学技术学术著作', '宝典系列', '人民邮电出版社', 'VB书架', '0'),
('3423535634', '电子科学与技术', '宝典系列', '人民邮电出版社', 'VB书架', ' 0'),
('325213211', '计算机科学与技术', 'Vue', '人民邮电出版社', 'VB书架', ' 0'),
('131423534', '科学技术与工程', 'Vue', '人民邮电出版社', 'VB书架', ' 0'),
('3546754524', '地理信息科学', '政治', '人民邮电出版社', 'PHP书架', ' 0'),
('325346234', '人民义务教育法规', '政治', '人民邮电出版社', 'PHP书架', ' 0');

-- --------------------------------------------------------

--
-- 表的结构 `borrow`
--

CREATE TABLE IF NOT EXISTS `borrow` (
  `barcode` varchar(225) DEFAULT NULL COMMENT '图书条形码',
  `bookname` varchar(225) DEFAULT NULL COMMENT '图书名',
  `typeid` varchar(10) DEFAULT NULL COMMENT '图书类型',
  `bookpress` varchar(225) DEFAULT NULL COMMENT '图书出版社',
  `bookcase` varchar(10) DEFAULT NULL COMMENT '书架',
  `readerid` varchar(10) DEFAULT NULL COMMENT '读者id',
  `borrowday` date DEFAULT NULL COMMENT '借书日期',
  `returnday` date DEFAULT NULL COMMENT '还书日期',
  `state` varchar(10) DEFAULT '0' COMMENT '状态：检查是否还书：1为已还，0为未还',
  `overdue` varchar(10) DEFAULT '0' COMMENT '逾期：1为逾期，0为未逾期',
  `fine` varchar(225) DEFAULT '0' COMMENT '罚款：借书的有效期是30天，罚款是逾期一天0.5',
  `pay` varchar(10) DEFAULT NULL COMMENT '罚款是否缴清'
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `borrow`
--

INSERT INTO `borrow` (`barcode`, `bookname`, `typeid`, `bookpress`, `bookcase`, `readerid`, `borrowday`, `returnday`, `state`, `overdue`, `fine`, `pay`) VALUES
('123456789', 'PHP数据库系统开发完全手册', '数据库技术', '人民邮电出版社', 'VB书架', '123', '2017-10-20', '2017-12-13', '1', '1', '27', '是'),
('987654321', 'PHP函数参考大全', '数据库技术', '人民邮电出版社', 'VB书架', '123', '2017-12-10', '2017-12-13', '1', '0', '0', NULL),
('123456789', 'PHP数据库系统开发完全手册', '数据库技术', '人民邮电出版社', 'VB书架', '234', '2017-10-16', '2017-10-24', '1', '0', '0', NULL),
('3466432245', '心理咨询大全', '心理', '人民邮电出版社', '文学书架', '123', '2017-10-13', '2017-12-14', '1', '1', '31', '是'),
('3466432245', '心理咨询大全', '心理', '人民邮电出版社', '文学书架', '234', '2017-10-12', '2017-12-15', '1', '1', '32', '否'),
('3466432245', '心理咨询大全', '心理', '人民邮电出版社', '文学书架', '345', '2017-10-19', '2017-12-15', '1', '1', '28.5', '否'),
('3466432245', '心理咨询大全', '心理', '人民邮电出版社', '文学书架', '456', '2017-10-13', '2017-12-14', '1', '1', '31', '是'),
('5435290709', '毛概', '政治', '人民邮电出版社', '政治书架', '123', '2017-11-21', '2017-12-15', '1', '0', '0', ''),
('5435290709', '毛概', '政治', '人民邮电出版社', '政治书架', '234', '2017-11-23', '2017-12-15', '1', '0', '0', NULL),
('5435290709', '毛概', '政治', '人民邮电出版社', '政治书架', '123', '2017-12-09', '2017-12-15', '1', '0', '0', NULL),
('1230987746', 'Vue.js实例大全', 'Vue', '人民邮电出版社', 'Vue书架', '123', '2017-10-09', '2017-12-14', '1', '1', '33', '是'),
('98765432144', 'PHP函数参考大全', '数据库技术', '人民邮电出版社', 'PHP书架', '666', '2017-12-18', NULL, '0', '0', '0', NULL),
('12434234345', '往生路', '心理', '人民邮电出版社', '文学书架', '66666', '2017-12-15', '2017-12-15', '1', '0', '0', NULL),
('123456789', 'PHP数据库系统开发完全手册', '数据库技术', '人民邮电出版社', 'VB书架', '56677', '2017-12-13', '2017-12-14', '1', '0', '0', NULL),
('1243423534', '得到的往生', '心理', '人民邮电出版社', '文学书架', '66666', '2017-12-15', '2017-12-15', '1', '0', '0', NULL),
('12434234345', '往生路', '心理', '人民邮电出版社', '文学书架', '234', '2017-10-18', '2017-12-21', '1', '1', '32', '否'),
('12345678954', 'PHP数据库系统开发完全手册', '数据库技术', '人民邮电出版社', 'VB书架', '234', '2017-09-18', '2017-12-18', '1', '1', '45.5', '否'),
('98765432144', 'PHP函数参考大全', '数据库技术', '人民邮电出版社', 'PHP书架', '456', '2017-12-19', '2017-12-21', '1', '0', '0', NULL),
('98765432144', 'PHP函数参考大全', '数据库技术', '人民邮电出版社', 'PHP书架', '222', '2017-12-19', '2017-12-21', '1', '0', '0', NULL),
('98765432144', 'PHP函数参考大全', '计算机程序设计', '人民邮电出版社', 'PHP书架', '555', '2017-12-21', '2017-12-21', '1', '0', '0', NULL),
('12434234345', '往生路', '心理', '人民邮电出版社', '文学书架', '3546', '2017-12-22', NULL, '0', '0', '0', NULL),
('98765432144', 'PHP函数参考大全', '计算机程序设计', '人民邮电出版社', 'PHP书架', '123', '2017-12-23', NULL, '0', '0', '0', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `message`
--

CREATE TABLE IF NOT EXISTS `message` (
  `name` varchar(10) DEFAULT NULL COMMENT '用户名',
  `password` varchar(10) DEFAULT NULL COMMENT '密码'
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `message`
--

INSERT INTO `message` (`name`, `password`) VALUES
('1', '1'),
('2', '2');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `name` varchar(255) NOT NULL DEFAULT '',
  `password` varchar(255) NOT NULL,
  `id` varchar(10) DEFAULT NULL COMMENT '读者编号'
) ENGINE=MyISAM DEFAULT CHARSET=gbk;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`name`, `password`, `id`) VALUES
('1111', '1111', '123'),
('liuqiao666', '123456', '234'),
('1002', '143143', '345'),
('1001', '123123', '456');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
